camaar/app/views/formularios/show.html.erb

    <div class='questaos-container'>
      <% @template.questaos.each do |questao| %>
---
SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]

          <ul>
            <% questao.alternativas.each do |alternativa| %>
              <% @resultado = Resultado.find_by(formulario: @formulario, template: @template, questao: questao, alternativa: alternativa) %>
---
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]
SELECT "resultados".* FROM "resultados" WHERE "resultados"."formulario_id" = ? AND "resultados"."template_id" = ? AND "resultados"."questao_id" = ? AND "resultados"."alternativa_id" = ? LIMIT ?  [["formulario_id", 1], ["template_id", 1], ["questao_id", 1], ["alternativa_id", 1], ["LIMIT", 1]]

          <div>
            <% @resultado_discursivo = Resultado.find_by(formulario: @formulario, template: @template, questao: questao) %>
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."formulario_id" = ? AND "resultados"."formulario_id" = ? AND "resultados"."template_id" = ? AND "resultados"."questao_id" = ? LIMIT ?  [["formulario_id", 1], ["formulario_id", 1], ["template_id", 1], ["questao_id", 1], ["LIMIT", 1]]