camaar/app/views/templates/edit.html.erb

SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 1]]
---
            <h2>Editar Questões</h2>
            <% @template.questaos.each do |questao| %>

SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 1]]
---
                        <div class='alternativas-container'>
                            <% questao.alternativas.each do |alternativa| %>

SELECT "tipos".* FROM "tipos"
---
                <%= label_tag :tipo_id, "Tipo da Questão" %>
                <%= select_tag :tipo_id, options_from_collection_for_select(Tipo.all, :id, :nome), prompt: "Selecione um tipo", class: 'form-control', required: true %>