camaar/app/views/templates/new.html.erb

SELECT "tipos".* FROM "tipos"
---
            <%= questao_form.text_field :pergunta, required: true %>
            <%= questao_form.select :tipo_id, options_from_collection_for_select(Tipo.all, :id, :nome), prompt: "Selecione um tipo", class: 'form-control', required: true %>