camaar/app/controllers/alternativas_controller.rb

    def set_alternativa
      @alternativa = Alternativa.find(params[:id])
---
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]