camaar/app/controllers/formularios_controller.rb

  def show
    @formulario = Formulario.find(params[:id])
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def responder
    @formulario = Formulario.find(params[:id])
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @formulario = Formulario.new(formulario_params)

    if @formulario.save
      criar_resultados_formulario(@formulario)
      redirect_to @formulario, notice: 'Formulário foi criado com sucesso.'
    else
      @templates = Template.all
---
INSERT INTO "formularios" ("dataDeTermino", "nome", "respondentes", "docente_id", "template_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "templates".* FROM "templates"

  def destroy
    @formulario = Formulario.find(params[:id])
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def criar_resultados_formulario(formulario)
      template = formulario.template
      template.questaos.each do |questao|
        questao.alternativas.each do |alternativa|
          Resultado.create!(
            formulario: formulario,
            template: template,
            questao: questao,
            alternativa: alternativa,
            respostas: 0,
            respostas_discursivas: ""
          )
---
SELECT "questaos".* FROM "questaos" WHERE "questaos"."template_id" = ?  [["template_id", 2]]
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."questao_id" = ?  [["questao_id", 4]]
INSERT INTO "resultados" ("formulario_id", "template_id", "questao_id", "alternativa_id", "respostas", "respostas_discursivas", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"