camaar/app/controllers/templates_controller.rb

  def create
    @template = Template.new(template_params)
    @template.docente = Docente.find_by(user_id: current_user.id)

    if @template.save
---
SELECT "docentes".* FROM "docentes" WHERE "docentes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "templates" ("nome", "docente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["nome", "teste de historia"], ["docente_id", 1], ["created_at", "2024-07-02 19:59:37.502739"], ["updated_at", "2024-07-02 19:59:37.502739"]]

    def set_template
      @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]